

clc, close all, clear all

% Εμφάνιση σχολίων και αναφορά στο m-file.
help merosA_15_14ii

l1=length('DIMITRIOS'); % Μήκος Ονόματος l1.
l2=length('ARCHONTIS'); % Μήκος Επιθέτου l2.
 
% Υπολογισμός ω1.
ww1 = mod(10/11*(max(l1,l2))/(l1+l2),1);
w1 = pi*ww1;
 
% Υπολογισμός ω2. 
ww2 = mod(ww1+1/4,1);
w2 = pi*ww2;

L=256; % Μήκος Σήματος L = 256 Δειγμάτων.

n=0:1:L-1; % Μήκος του n.
 
% Πλάτοι των ημιτόνων.
A1=1; 
 
A2=0.75;
 
x1=A1*cos(w1*n); % Σχηματισμός 1ου Ημιτόνου
 
x2=A2*cos(w2*n); % Σχηματισμός 2ου Ημιτόνου
 
x0=x1+x2; % Σχηματισμός Σήματος x[n] χωρίς το w[n].
 
w=hamming(L); % Δημιουργία του w[n].

x=x1.*w'+x2.*w'; % Σήμα ανάλυσης x[n].

N=1024; % Μήκος Διακριτού Μετ/σμού Fourier.

X=fft(x,N); % Υπολογισμός DFT

% Χωρίζω το παράθυρο της εικόνας σε 2 μέρη και χρησιμοποιώ το 1ο Παράθυρο.
subplot(2,1,1)

% Αρχικό Σήμα x[n].
stem(n,x); % Εμφάνιση γραφήματος στον Διακριτό Χρόνο.
axis([0,255,-2,2]); % Κλίμακα αξόνων
grid on % Σχεδιασμός γραμμών πλέγματος του γραφήματος.
title('Αρχικό Σήμα x[n]');
xlabel('’ξονας τιμών n');

k=0:1:N-1; % Είναι N = 1024 Δείγματα.

% Έχοντας χωρισμένο το παράθυρο, χρησιμοποιώ το 2ο Παράθυρο.
subplot(2,1,2)

stem(k,abs(X)); % Εμφάνιση του Πλάτους του.
axis([0,1023,0,75]); % Κλίμακα αξόνων
grid on % Σχεδιασμός γραμμών πλέγματος του γραφήματος.
title('DFT Δειγμάτων');
xlabel('Αξονας τιμών k');
ylabel('Πλάτος');
