

clc, close all, clear all

% Εμφάνιση σχολίων και αναφορά στο m-file.
help merosA_15_11

l1=length('DIMITRIOS'); % Μήκος Ονόματος l1.
l2=length('ARCHONTIS'); % Μήκος Επιθέτου l2.
 
% Υπολογισμός ω1.
ww1 = mod(10/11*(max(l1,l2))/(l1+l2),1);
w1 = pi*ww1;
 
% Υπολογισμός ω2. 
ww2 = mod(ww1+1/4,1);
w2 = pi*ww2;

L=512; % Μήκος Σήματος L = 512 Δειγμάτων.

n=0:1:L-1; % Μήκος του n.
 
% Πλάτοι των ημιτόνων.
A1=1; 
 
A2=0.75;
 
x1=A1*cos(w1*n); % Σχηματισμός 1ου Ημιτόνου
 
x2=A2*cos(w2*n); % Σχηματισμός 2ου Ημιτόνου
 
x0=x1+x2; % Σχηματισμός Σήματος x[n] χωρίς το w[n].
 
w=hamming(L); % Δημιουργία του w[n].

x=x1.*w'+x2.*w'; % Σήμα ανάλυσης x[n].

y=xcorr(x); % Υπολογισμός xcorr

stem(y); % Εμφάνιση γραφήματος στον Διακριτό Χρόνο.
grid on % Σχεδιασμός γραμμών πλέγματος του γραφήματος.
title('ΑΥΤΟΣΥΣΧΕΤΙΣΗ ΣΗΜΑΤΟΣ x[n]');
