

clc, close all, clear all

% Εμφάνιση σχολίων και αναφορά στο m-file.
help merosB_24vi

for a=1.2:-0.1:0.1;
% Τα μηδενικά (Αριθμητής) // 1i = j//
zer=1.2*exp(1i*pi*[-0.35 0.35]'); 

% Οι πόλοι (Παρονομαστής) // 1i = j//
pol=[0.65*exp(1i*2*pi*[-0.58 0.58]') ; a*exp(1i*pi*[-0.35 0.35]') ; -0.85*exp(1i*2*pi*[-0.56 0.56]')];

figure(1) % Γράφημα Νο.1
% Χωρίζω το παράθυρο της εικόνας σε 2 μέρη και χρησιμοποιώ το 1ο Παράθυρο.
subplot(211);
zplane(zer,pol); % Σχεδιασμός πόλων και μηδενικών
grid on % Σχεδιασμός γραμμών πλέγματος του γραφήματος.
  
k=1; % Σταθερά κέρδους

% Εύρεση της Συνάρτησης Μεταφοράς
% num = Συντελεστές Αριθμητή
% den = Συντελεστές Παρονομαστή
[num,den]=zp2tf(zer,pol,k); 

% Πλάτος
w=0:pi/255:pi;
H1=freqz(num,den,w);
m1=abs(H1);
figure(1); % Γράφημα Νο.1
% Έχοντας χωρισμένο το παράθυρο, χρησιμοποιώ το 2ο Παράθυρο.
subplot(212);
plot(w/pi,m1);% Σχεδιασμός Πλάτους
title('Magnitute');

pause (1) % Pause for 1 second

end
